src/cf/DataProcessors/ВыгрузкаПриемаСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаПриемаСотрудников</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/Enums/Пол.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>Пол</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПолМужской</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолЖенский</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ПриемНаРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ПриемНаРаботу</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДолжностьСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оклад</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/DataProcessors/ВыгрузкаПриемаСотрудников/Forms/ВыгрузкаПриемаСотрудников/Ext/Form/Module.bsl
&НаСервере
Функция ВыгрузитьДокумент(ТекДокумент)
	ТипПриемНаРаботу = ФабрикаXDTO.Тип("http://www.sample-package.org", "ПриемНаРаботу");
	ОбъектПриемНаРаботу = ФабрикаXDTO.Создать(ТипПриемНаРаботу);	
	
	ТипДолжность = ФабрикаXDTO.Тип("http://www.sample-package.org", "Должности");
	ТипСотрудник = ФабрикаXDTO.Тип("http://www.sample-package.org", "Сотрудники");
	ТипТЧСотрудники = ФабрикаXDTO.Тип("http://www.sample-package.org", "ПриемНаРаботу.Сотрудники");
	ТипТЧСотрудникиСтрока = ФабрикаXDTO.Тип("http://www.sample-package.org", "ПриемНаРаботу.Сотрудники.Строка");
	ТипЗначенияПол = ФабрикаXDTO.Тип("http://www.sample-package.org", "Пол");
	
	ОбъектДолжность = ФабрикаXDTO.Создать(ТипДолжность);
	ОбъектДолжность.Наименование = ТекДокумент.ДолжностьСотрудника.Наименование;
	
	ОбъектТЧСотрудники = ФабрикаXDTO.Создать(ТипТЧСотрудники);
	Для Каждого СтрокаТЧ ИЗ ТекДокумент.Сотрудники Цикл
		ОбъектСотрудник	= ФабрикаXDTO.Создать(ТипСотрудник);
		ОбъектСотрудник.ФИО = СтрокаТЧ.Сотрудник.Наименование;
		ОбъектСотрудник.ДатаРождения = СтрокаТЧ.Сотрудник.ДатаРождения;
		Если СтрокаТЧ.Сотрудник.Пол = Перечисления.Пол.ПолЖенский Тогда
			ОбъектСотрудник.Пол = ФабрикаXDTO.Создать(ТипЗначенияПол, "ПолЖенский");
		ИначеЕсли СтрокаТЧ.Сотрудник.Пол = Перечисления.Пол.ПолМужской Тогда
			ОбъектСотрудник.Пол = ФабрикаXDTO.Создать(ТипЗначенияПол, "ПолМужской");
		КонецЕсли;
		
		ОбъектСтрокаТЧСотрудники = ФабрикаXDTO.Создать(ТипТЧСотрудникиСтрока);
		ОбъектСтрокаТЧСотрудники.Сотрудник = ОбъектСотрудник;
		ОбъектСтрокаТЧСотрудники.Оклад  = СтрокаТЧ.Оклад;	
		
		ОбъектТЧСотрудники.Строка.Добавить(ОбъектСтрокаТЧСотрудники);
	КонецЦикла;
	
	ОбъектПриемНаРаботу.Дата = ТекДокумент.Дата;
	ОбъектПриемНаРаботу.Номер = ТекДокумент.Номер;
	ОбъектПриемНаРаботу.Должность = ОбъектДолжность;
	ОбъектПриемНаРаботу.Сотрудники = ОбъектТЧСотрудники;
	
	Возврат ОбъектПриемНаРаботу; 
КонецФункции

&НаКлиенте
Процедура ИмяФайлаОбменаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = "Файл данных: ";
	Диалог.Фильтр = "Файл XML (*.xml)|*.xml";
	Если Диалог.Выбрать() Тогда
		ИмяФайлаОбмена = Диалог.ПолноеИмяФайла;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьДокументыНаСервере()
	Если ИмяФайлаОбмена = "" Тогда
		Возврат;	
	КонецЕсли;
	
	ФайлОбмена = Новый ЗаписьXML;
	ФайлОбмена.ОткрытьФайл(ИмяФайлаОбмена);
	
	ФайлОбмена.ЗаписатьОбъявлениеXML();
	ФайлОбмена.ЗаписатьНачалоЭлемента("Message");
	
	Выборка = Документы.ПриемНаРаботу.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектXDTO = ВыгрузитьДокумент(Выборка);
		
		ФабрикаXDTO.ЗаписатьXML(ФайлОбмена, ОбъектXDTO);
	КонецЦикла;
	
	ФайлОбмена.ЗаписатьКонецЭлемента();
	ФайлОбмена.Закрыть();	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДокументы(Команда)
	ВыгрузитьДокументыНаСервере();
КонецПроцедуры
